Validation/VerticalFilm/0/T.org
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 646;

boundaryField
{
    up
    {
        type            fixedValue;
        value           uniform 646;
    }
    down
    {
        type            inletOutlet;
        inletValue      uniform 646;
        value           uniform 646;
    }
    left
    {
        type            fixedValue;
        value           uniform 626;
    }
    right
    {
        type            inletOutlet;
        inletValue      uniform 646;
        value           uniform 646;
    }
    front
    {
        type            empty;
    }
    back
    {
        type            empty;
    }
}


// ************************************************************************* //
